20241107T232232--kdoc-275-まず何を前提にしてマシンを構成しようとしているか__permanent.org
:properties:
:ID: 20241107T232232
:end:
#+title:      KDOC 275: まず何を前提にしてマシンを構成しようとしているか
#+date:       [2024-11-07 Thu 23:22]
#+filetags:   :permanent:
#+identifier: 20241107T232232

* この文書のステータス
- 作成
  - [X] 2024-11-07 貴島
- レビュー
  - [X] 2024-11-08 貴島

* 概要

レジスタマシンとスタックマシンを選ぶ判断基準の1つは、なにを前提に構成しようとしているかである。CPU上に構成しようとすればレジスタマシンを採用することが多く、リソースを抽象化して仮想マシンとして構成しようとすればスタックマシンを採用することが多い。

ググって出てきたもの。

- [[https://magazine.rubyist.net/articles/0007/0007-YarvManiacs.html][YARV Maniacs 【第 2 回】 VM ってなんだろう]]
  - レジスタマシン: ハードウェア的に作りやすい
  - スタックマシン: コンパイラが非常に簡単に作れるが最適化が少しやりづらい
- [[http://fe0km.blog.fc2.com/blog-entry-106.html][なんだか雲行きの怪しい雑記帖 週アレ（１４）　スタックマシンとレジスタマシン]]
  - レジスタマシン: パフォーマンスが出やすい
  - スタックマシン: シンプル

* 関連
- [[id:20241104T003113][KDOC 266: レジスタマシンとスタックマシンの使い分け]]。元になった疑問
