20241107T232232--kdoc-275-まず何を前提にしてマシンを構成しようとしているか__permanent.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-20T22:33:18Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 275: まず何を前提にしてマシンを構成しようとしているか</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 275: まず何を前提にしてマシンを構成しようとしているか</h1>
<div id="outline-container-org9236556" class="outline-2">
<h2 id="org9236556"><a href="#org9236556">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org9236556">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-11-07 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-11-08 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org1abbc84" class="outline-2">
<h2 id="org1abbc84"><a href="#org1abbc84">概要</a></h2>
<div class="outline-text-2" id="text-org1abbc84">
<p>
レジスタマシンとスタックマシンを選ぶ判断基準の1つは、なにを前提に構成しようとしているかである。CPU上に構成しようとすればレジスタマシンを採用することが多く、リソースを抽象化して仮想マシンとして構成しようとすればスタックマシンを採用することが多い。
</p>

<p>
ググって出てきたもの。
</p>

<ul class="org-ul">
<li><a href="https://magazine.rubyist.net/articles/0007/0007-YarvManiacs.html">YARV Maniacs 【第 2 回】 VM ってなんだろう</a>
<ul class="org-ul">
<li>レジスタマシン: ハードウェア的に作りやすい</li>
<li>スタックマシン: コンパイラが非常に簡単に作れるが最適化が少しやりづらい</li>
</ul></li>
<li><a href="http://fe0km.blog.fc2.com/blog-entry-106.html">なんだか雲行きの怪しい雑記帖 週アレ（１４）　スタックマシンとレジスタマシン</a>
<ul class="org-ul">
<li>レジスタマシン: パフォーマンスが出やすい</li>
<li>スタックマシン: シンプル</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgf7a7f71" class="outline-2">
<h2 id="orgf7a7f71"><a href="#orgf7a7f71">関連</a></h2>
<div class="outline-text-2" id="text-orgf7a7f71">
<ul class="org-ul">
<li><a href="20241104T003113--kdoc-266-レジスタマシンとスタックマシンの使い分けは何か__permanent.html#ID-20241104T003113">KDOC 266: レジスタマシンとスタックマシンの使い分けは何か?</a>。元になった疑問</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
